:SETUP:
#+TITLE: Code and Methods for Estimating Constant Frisch Elasticity Demand Systems
#+AUTHOR: Ethan Ligon
#+OPTIONS: toc:nil
#+PROPERTY: header-args:python :results output :noweb no-export :exports code :comments link :prologue (format "# Tangled on %s" (current-time-string))
#+LATEX_HEADER: \renewcommand{\vec}[1]{\boldsymbol{#1}}
#+LATEX_HEADER: \newcommand{\T}{\top}
#+LATEX_HEADER: \newcommand{\E}{\ensuremath{\mbox{E}}}
#+LATEX_HEADER: \newcommand{\R}{\ensuremath{\mathbb{R}}}
#+LATEX_HEADER: \newcommand{\Cov}{\ensuremath{\mbox{Cov}}}
#+LATEX_HEADER: \newcommand{\Eq}[1]{(\ref{eq:#1})}
#+LATEX_HEADER: \newcommand{\Fig}[1]{Figure \ref{fig:#1}} \newcommand{\Tab}[1]{Table \ref{tab:#1}}
#+LATEX_HEADER: \renewcommand{\refname}{}
#+LATEX_HEADER: \usepackage{stringstrings}\renewcommand{\cite}[1]{\caselower[q]{#1}\citet{\thestring}}
:END:
** Eigenvalue Decomposition Approach to Computing the SVD
Here's an approach that involves estimating a covariance matrix, and
extracting $U$ and $\Sigma$ from that; then backing out estimated $V$,
for columns satisfying a rank condition.  Unlike some alternative
approaches estimates do not depend on the order of observations.  

A parameter =min_obs= governs how  conservative the algorithm is in
estimating the covariance matrix; it's equal to  minimum number of
cross-products required to  estimate an element of that matrix.  Note
that if this is a small integer one is more apt to obtain estimates
of the covariance matrix which are  not positive definite.
#+name: svd_missing
#+BEGIN_SRC python
#name: svd_missing

import numpy as np
import warnings

def missing_inner_product(X,min_obs=None):
    """Compute inner product X.T@X, allowing for possibility of missing data."""
    n,m=X.shape

    if n<m: 
        axis=1
        N=m
    else: 
        axis=0
        N=n

    xbar=X.mean(axis=axis)

    if axis:
        C=(N-1)*X.T.cov(min_periods=min_obs)
    else:
        C=(N-1)*X.cov(min_periods=min_obs)

    return C + N*np.outer(xbar,xbar)

def drop_columns_wo_covariance(X,min_obs=None,VERBOSE=False):
    """Drop columns from pd.DataFrame that lead to missing elements of covariance matrix."""

    m,n=X.shape
    assert m>n, "Fewer rows than columns.  Consider passing the transpose."

    # If good has fewer total observations than min_obs, can't possibly
    # have more cross-products.  Dropping here is faster than iterative procedure below.
    X = X.loc[:,X.count()>=min_obs]

    HasMiss=True
    while HasMiss:
        foo = X.cov(min_periods=min_obs).count()
        if np.sum(foo<X.shape[1]):
            badcol=foo.idxmin()
            del X[badcol] # Drop  good with  most missing covariances
            if VERBOSE: print("Dropping %s, with only %d covariances." % (badcol,foo[badcol]))
        else:
            HasMiss=False

    return X

def svd_missing(A,max_rank=None,min_obs=None,heteroskedastic=False):
    """Singular Value Decomposition with missing values

    Returns matrices U,S,V.T, where A~=U*S*V.T.

    Inputs: 
        - A :: matrix or pd.DataFrame, with NaNs for missing data.

        - max_rank :: Truncates the rank of the representation.  Note
                      that this impacts which rows of V will be
                      computed; each row must have at least max_rank
                      non-missing values.  If not supplied rank may be
                      truncated using the Kaiser criterion.

        - min_obs :: Smallest number of non-missing observations for a 
                     row of U to be computed.

        - heteroskedastic :: If true, use the "heteroPCA" algorithm
                       developed by Zhang-Cai-Wu (2018) which offers a
                       correction to the svd in the case of
                       heteroskedastic errors.  If supplied as a pair,
                       heteroskedastic[0] gives a maximum number of
                       iterations, while heteroskedastic[1] gives a
                       tolerance for convergence of the algorithm.

    Ethan Ligon                                        September 2021

    """
    max_its=50
    tol = 1e-3

    P=missing_inner_product(A,min_obs=min_obs) # P = A.T@A

    def heteropca(C,r=1,max_its=max_its,tol=tol):
        """Estimate r factors and factor weights of covariance matrix C."""

        N = C - np.diag(np.diag(C))

        NLast = 1
        t = 0
        while np.linalg.norm(N-NLast)>tol and t<max_its:
            NLast = N

            u,s,vt = np.linalg.svd(N,full_matrices=False)

            Ntilde = u[:,:r]@np.diag(s[:r])@vt[:r,:]

            N = N - np.diag(np.diag(N)) + np.diag(np.diag(Ntilde))

            t += 1

        if t==max_its:
            warnings.warn("Exceeded maximum iterations (%d)" % max_its)

        s = np.sqrt(s[:r])
        
        u = u[:,:r]

        return u,s

    sigmas,u=np.linalg.eigh(P)

    order=np.argsort(-sigmas)
    sigmas=sigmas[order]

    # Truncate rank of representation using Kaiser criterion (positive eigenvalues)
    u=u[:,order]
    u=u[:,sigmas>0]
    s=np.sqrt(sigmas[sigmas>0])

    if max_rank is not None and len(s) > max_rank:
        u=u[:,:max_rank]
        s=s[:max_rank]

    r=len(s)

    if heteroskedastic:
        try:
            max_its,tol = heteroskedastic
        except TypeError:
            pass
            
        u,s = heteropca(P,r=r,max_its=max_its,tol=tol)
    
    us=u@np.diag(s)

    v=np.zeros((len(s),A.shape[1]))
    for j in range(A.shape[1]):
        a=A.iloc[:,j].values.reshape((-1,1))
        x=np.nonzero(~np.isnan(a))[0] # non-missing elements of vector a
        if len(x)>=r:
            v[:,j]=(np.linalg.pinv(us[x,:])@a[x]).reshape(-1)
        else:
            v[:,j]=np.nan

    return u,s,v.T
#+END_SRC

#+results: svd_missing


Unit test drop_columns_wo_cov function using alternative implementation.

#+name: test_drop_columns_wo_cov
#+begin_src python :noweb no-export :results output :tangle ../cfe/stochastic_test/test_drop_columns_wo_cov.py
#name: test_drop_columns_wo_cov
from cfe.estimation import drop_columns_wo_covariance
import pandas as pd
import numpy as np
import pytest 

# generate random data
N = 5
M = 3
squaredf = pd.DataFrame(np.random.normal(size=(N, N)))
rectandf = pd.DataFrame(np.random.normal(size=(N, M)))

# min_obs values to test: 1, ..., M plus None
min_obs_list = [i for i in range(M)]
min_obs_list.append(None)

# create test cases by introducing na values
line = rectandf.copy()
line.iloc[1, :] = np.NaN

rand = rectandf.copy()
rand.iloc[1, 1] = np.NaN
rand.iloc[3, 2] = np.NaN

single = rectandf.copy()
single.iloc[2,2] = np.NaN

another = rectandf.copy()
another.iloc[0,1] = np.NaN 
another.iloc[1,1] = np.NaN 
another.iloc[2,1] = np.NaN 

@pytest.mark.parametrize("df", [
    line,
    rand,
    single,
    another
])
def test_equal_to_drop_cols(df):
    results = 0
    for m in min_obs_list:
        foo = drop_columns_wo_covariance(df, min_obs=m)
        baz = df.loc[:,df.count()>=m]

        print(foo)

        # get difference 
        diff = foo - baz
        diff = diff.fillna(0)

        if ~((foo.shape == baz.shape) & ((diff < 1e-5).all(axis=None))):
            results += 1

    assert results == 0

# end rest_drop_columns_wo_cov.py

#+end_src

#+RESULTS: test_drop_columns_wo_cov
: Missing dependencies for OracleDemands.

** Test of Rank 1 SVD Approximation to Matrix with Missing Data

First, some code to check if approximation works for a simple, small
scale example.

#+name: svd_rank1_approximation_with_missing_data_example
#+begin_src python :noweb no-export :results output :tangle ../cfe/stochastic_test/test_svd_rank1_approximation_with_missing_data_example.py
#name: svd_rank1_approximation_with_missing_data_example
import numpy as np
import pandas as pd
<<svd_rank1_approximation_with_missing_data>>

(n,m)=(1000,500)
a=np.random.normal(size=(n,1))
b=np.random.normal(size=(1,m))
e=np.random.normal(size=(n,m))*1e-5*0

X0=np.array([[-0.22,  0.32, -0.43],
             [0.01, 0.00,  0.00],
             [-0.22,  0.31, -0.42],
             [0.01, -0.03,  0.04],
             [-0.21, 0.31, -0.38]])
X0 = np.outer(a,b) + e

X0=X0-X0.mean(axis=1).reshape((-1,1))

X=X0.copy()
X[0,0]=np.nan
X[0,1]=np.nan

X0=pd.DataFrame(X0).T
X=pd.DataFrame(X).T

def test_symmetry_of_svd_rank1_approximation():
    Xhat=svd_rank1_approximation_with_missing_data(X0,VERBOSE=False)
    XhatT=svd_rank1_approximation_with_missing_data(X0.T,VERBOSE=False)
    assert np.all(Xhat.T == XhatT)

def test_accuracy_of_svd_rank1_approximation():
    Xhat=svd_rank1_approximation_with_missing_data(X,VERBOSE=False)
    error = X0 - Xhat
    assert np.max(np.max(error)<1e-2)
  
Xhat=svd_rank1_approximation_with_missing_data(X,VERBOSE=False)
XhatT=svd_rank1_approximation_with_missing_data(X0.T,VERBOSE=False)

print(X0)
print(X)
print(Xhat)
print((X0-Xhat)/X0)

assert np.linalg.norm((X0-Xhat)/X0,ord=np.inf)//np.sqrt(np.prod(X0.shape)) < 1e-2
#+end_src

#+results: svd_rank1_approximation_with_missing_data_example
#+begin_example
      0     1     2     3     4
0 -0.22  0.01 -0.22  0.01 -0.21
1  0.32  0.00  0.31 -0.03  0.31
2 -0.43  0.00 -0.42  0.04 -0.38
      0     1     2     3     4
0 -0.22  0.01 -0.22  0.01 -0.21
1  0.32  0.00  0.31 -0.03  0.31
2 -0.43  0.00 -0.42  0.04 -0.38
          0         1         2         3         4
0 -0.223913  0.001494 -0.218917  0.019316 -0.206088
1  0.324141 -0.002162  0.316909 -0.027962  0.298337
2 -0.424777  0.002834 -0.415299  0.036644 -0.390962
          0         1         2         3         4
0 -0.017786  0.850623  0.004924 -0.931615  0.018629
1 -0.012941       inf -0.022286  0.067917  0.037622
2  0.012146      -inf  0.011192  0.083900 -0.028847
#+end_example

#+name: svd_rank1_approximation_with_missing_data_test
#+begin_src python :noweb no-export :results output :var n=12 :var m=2000 :var percent_missing=0.5 :var SEED=0 :tangle ../cfe/test/svd_rank1_approximation_with_missing_data_test.py
#name: svd_rank1_approximation_with_missing_data_test
import numpy as np
import pandas as pd

# Tangling may not include :vars from header
try: 
    SEED
except NameError: # :var inputs not set?
    n=12
    m=2000
    percent_missing=0.5
    SEED=0
  
<<svd_rank1_approximation_with_missing_data>>

if SEED:
    np.random.seed(SEED)

a=np.random.normal(size=(n,1))
b=np.random.normal(size=(1,m))
e=np.random.normal(size=(n,m))*5e-1

X0=np.outer(a,b) + e
X0=X0-X0.mean(axis=0)

X=X0.copy()
X[np.random.random_sample(X.shape)<percent_missing]=np.nan

X0=pd.DataFrame(X0).T
X=pd.DataFrame(X).T

Xhat,u,s,v=svd_rank1_approximation_with_missing_data(X,VERBOSE=False,return_usv=True)

#rho_a=np.corrcoef(np.c_[a,u[:,0]],rowvar=0)[0,1]
rho_a=pd.DataFrame({'a':a.reshape(-1),'u':u}).corr().iloc[0,1]
rho_b=pd.DataFrame({'b':pd.Series(b.reshape(-1)),'v':v}).corr().iloc[0,1]
missing=np.isnan(X.values).reshape(-1,1).mean()
print("Proportion missing %g and correlations are %5.4f and %5.4f." % (missing, rho_a,rho_b),)
print("Singular value=%g" % s[0],)
if SEED: print("Seed=%g" % SEED)
else: print()
#+end_src

#+results: svd_rank1_approximation_with_missing_data_test




* Estimation of reduced form

    This code takes as input time-varying household-level data on log
    expenditures and characteristics, and takes data defining markets
    and perhaps some prices.

    Data on prices is specified by providing a =pd.DataFrame= =P= with
    a MultiIndex of (period,market) indicated as =('t','m')=.  If
    provided, the dataframe =P= includes data on actual prices
    observed in different period-markets.  These data need not be
    complete, and in particular it's fine to provide prices for only a
    subset of goods.  However, if one or more prices is provided, one
    of the commodities should be chosen as a numéraire e.g.,
#+BEGIN_SRC python :exports code
ix=pd.MultiIndex.from_tuples([(1975,'Aurepalle'),(1975,'Shirapur'),(1975,'Kanzara'),
                              (1976,'Aurepalle'),(1976,'Shirapur'),(1976,'Kanzara'),
                              (1977,'Aurepalle'),(1977,'Shirapur'),(1977,'Kanzara'),
                              (1978,'Aurepalle'),(1978,'Shirapur'),(1978,'Kanzara')],names=['t','m'])
P=pd.DataFrame({'Rice':[4,5,4,5,6,5,6,7,6,7,8,7],
                'Sorghum':[2,3,2,2,3,2,3,4,3,4,5,6]},index=ix)

numeraire='Rice'
#+END_SRC

#+RESULTS:

Note that not all goods for which household level expenditures are
observed need to have  price supplied.  If prices for one good are
supplied, it should be the numéraire; if prices for two or more goods
are supplied it's possible to identify Frisch elasticities $\beta$ and
to estimate any missing prices.  

#+name: estimate_reduced_form
#+BEGIN_SRC python :noweb no-export :results output :tangle ../cfe/estimation.py
#name: estimate_reduced_form
import pandas as pd
import warnings
import sys
from collections import OrderedDict
from cfe.df_utils import drop_missing, ols, arellano_robust_cov, broadcast_binary_op, use_indices, df_norm

def estimate_reduced_form(y,z,return_v=False,return_se=False,VERBOSE=False):
  """Estimate reduced-form Frisch expenditure/demand system.

  Inputs:
      - y : pd.DataFrame of log expenditures or log quantities, indexed by (j,t,m),
            where j indexes the household, t the period, and m the market.
            Columns are different expenditure items, indexed by i.

      - z : pd.DataFrame of household characteristics; index should match that of y.
            Columns are different characteristics, indexed by l.

  Outputs:
      - a : Estimated good-time-market fixed effects.

      - ce : Residuals (can be provided as an input to get_log_lambdas()).

      - d : Estimated coefficients associated with characteristics z.

      - sed : (Optional, if return_se) Estimated standard errors for coefficients d.

      - sea : (Optional, if return_se) Estimated standard errors for coefficients a.

      - V : (Optional, if return_v) Estimated covariance matrix of coefficients d.

  Ethan Ligon                                            February 2017
  """
  try: # Be a little forgiving if t or m index is missing.
      assert y.index.names==['j','t','m'], "Indices should be (j,t,m)?"
      assert y.columns.name == 'i', "Name of column index should be i?"
  except AssertionError:
      y = y.reset_index()
      if not 'm' in y.columns: y['m']=1
      if not 't' in y.columns: y['t']=1
      y = y.set_index(['j','t','m'])
      y.columns.set_names('i',inplace=True)

  try:
      assert z.index.names==['j','t','m'], "Indices should be (j,t,m)?"
      assert z.columns.name == 'k', "Name of column index should be k?"
  except AssertionError:
      z = z.reset_index()
      if not 'm' in z.columns: z['m']=1
      if not 't' in z.columns: z['t']=1
      z = z.set_index(['j','t','m'])

      z.columns.set_names('k',inplace=True)

  assert len(z.index.intersection(y.index))>0, "Indices of z & y don't match."

  periods = list(set(y.index.get_level_values('t')))
  ms = list(set(y.index.get_level_values('m')))

  # Time-market dummies
  DateLocD = use_indices(y,['t','m'])
  DateLocD = pd.get_dummies(list(zip(DateLocD['t'],DateLocD['m'])))
  DateLocD.index = y.index

  sed = pd.DataFrame(columns=y.columns)
  sea = pd.DataFrame(columns=y.columns)
  a = pd.Series(index=y.columns,dtype=float)
  b = OrderedDict()
  d = OrderedDict()
  ce = pd.DataFrame(index=y.index,columns=y.columns)
  V = OrderedDict()

  for i,Item in enumerate(y.columns):
      if VERBOSE: print(Item)

      lhs,rhs=drop_missing([y.iloc[:,[i]],pd.concat([z,DateLocD],axis=1)])
      stdev = rhs.std()
      for constant in stdev[stdev==0].index.tolist():
          warnings.warn("No variation in: %s" % str(constant))
      rhs=rhs.loc[:,rhs.std()>0] # Drop  any X cols with no variation
      useDateLocs=list(set(DateLocD.columns.tolist()).intersection(rhs.columns.tolist()))

      # Calculate deviations
      lhsbar=lhs.mean(axis=0)
      assert ~np.any(np.isnan(lhsbar)), "Missing data in lhs for item %s." % Item
      assert np.all(lhs.std()>0), "No variation in non-missing data for item %s." % Item
      lhs=lhs-lhsbar
      lhs=lhs-lhs.mean(axis=0)

      rhsbar=rhs.mean(axis=0)
      assert ~np.any(np.isnan(rhsbar)), "Missing data in rhs?"
      rhs=rhs-rhsbar
      rhs=rhs-rhs.mean(axis=0)

      # Need to make sure time-market effects sum to zero; add
      # constraints to estimate restricted least squares
      ynil=pd.DataFrame([0],index=[(-1,0,0)],columns=lhs.columns)
      znil=pd.DataFrame([[0]*z.shape[1]],index=[(-1,0,0)],columns=z.columns)
      timednil=pd.DataFrame([[1]*DateLocD.shape[1]],index=[(-1,0,0)],columns=DateLocD.columns)

      # change append to concat: X=rhs.append(znil.join(timednil))
      X=pd.concat([rhs, znil.join(timednil)])
      X=X.loc[:,X.std()>0] # Drop  any X cols with no variation

      # Estimate d & b
      # change append to concat: lhs.append(ynil)
      myb,mye=ols(X,pd.concat([lhs, ynil]) ,return_se=False,return_v=False,return_e=True)
      ce[Item]=mye.iloc[:-1,:] # Drop constraint that sums time-effects to zero

      if return_v or return_se:
          if z.shape[1]:
              V[Item]=arellano_robust_cov(z,ce[Item])
              sed[Item]=pd.Series(np.sqrt(np.diag(V[Item])), index=z.columns) # reduced form se on characteristics

              stderrs = (mye.groupby(['t','m']).std()/np.sqrt(mye.groupby(['t','m']).count()))
              if len(useDateLocs) > 0:
                  sea[Item] = stderrs.squeeze()
              else:
                  sea[Item] = stderrs[Item]

      zvars = z.columns.intersection(myb.index)
      d[Item]= myb.loc[zvars].squeeze() # reduced form coefficients on characteristics

      b[Item] = myb.loc[useDateLocs].squeeze()  # Terms involving prices
      a[Item] = lhsbar.mean() - d[Item].squeeze().dot(rhsbar[zvars]) - np.array(b[Item]).dot(rhsbar[useDateLocs])

  b = pd.DataFrame(b,index=y.groupby(level=['t','m']).mean().index)
  b = b.T
  sed = sed.T
  sea = sea.T

  if b.shape[1]==1: # Only a single time-market
    assert np.all(np.isnan(b)), "Only one good-time effect should mean b not identified"
    b[:]=0

  d = pd.DataFrame(d).T
  d.index.name = 'i'

  out = [b.add(a,axis=0),ce,d]
  if return_se:
      out += [sed,sea]
  if return_v:
      V = xr.Dataset(V).to_array(dim='i')
      out += [V]
  return out
#+END_SRC

#+RESULTS: estimate_reduced_form
: Missing dependencies for OracleDemands.

*** Tests of estimation with missing data

#+name: test_estimate_with_missing
#+begin_src python :noweb no-export :results output :var SEED = 227 :tangle ../cfe/test/test_estimate_with_missing.py :exports none
#name: test_estimate_with_missing

import numpy as np
from cfe.result import to_dataframe

try:
    SEED 
except NameError: # :var inputs not set?
    n=12
    m=2000
    percent_missing=0.5
    SEED=0

if SEED:
    np.random.seed(seed=SEED)

<<estimate_reduced_form>>
<<artificial_data>>
<<svd_rank1_approximation_with_missing_data>>
<<get_loglambdas>>
<<df_utils>>

y,truth=artificial_data(T=2,N=5000,k=2,n=10,sigma_e=1e-10)

y = to_dataframe(y,['j','t','m']).T
#y = y.reset_index().set_index(['j','t','m'])

#beta,L,dz,p=truth
dz = to_dataframe(truth['characteristics'],['j','t','m']).T

#dz=dz.reset_index().set_index(['j','t','m'])
dz=np.log(dz)

numeraire=None #'x0'

# Try with missing data for contrast
y.values[np.random.random_sample(y.shape)<0.0]=np.nan

y.replace(-np.inf,np.nan,inplace=True)

#b,ce,d,V=estimate_bdce_with_missing_values(y,dz,return_v=True)
b,ce,d = estimate_reduced_form(y,dz,return_v=False)

bphi,logL=get_loglambdas(ce,TEST=True)
cehat=np.outer(pd.DataFrame(bphi),pd.DataFrame(-logL).T).T
cehat=pd.DataFrame(cehat,columns=bphi.index,index=logL.index)

print("Norm of error in approximation of CE: %f" % df_norm(cehat,ce))

# Some naive standard errors

#yhat=b.T.add(cehat + (dz.dot(d.T)),axis=0,level='t')
yhat = broadcast_binary_op(cehat + dz.dot(d.T),lambda x,y: x+y,b.T)

e=y.sub(yhat)

C = pd.DataFrame({"L0":to_dataframe(np.log(truth['lambdas'])),"Lhat":logL.squeeze()}).corr()
print("Correlation of log lambda with estimate (before normalization): %f" % C.values[0][-1])
assert C.values[0][-1]>0.97, "loglambda correlation with truth too low."

if not numeraire is None:
    logL=broadcast_binary_op(logL,lambda x,y: x+y,b.loc[numeraire]) # Add term associated with numeraire good
    b=b-b.loc[numeraire]
else:
    logL=broadcast_binary_op(logL,lambda x,y: x+y,b.mean()) # Add term associated with numeraire good
    b=b-b.mean()

# Evaluate estimate of beta:
print("Norm of (bphi,beta): %f" % np.var(bphi/truth['beta'])) # Funny norm deals with fact that b only identified up to a scalar

C = pd.DataFrame({"L0":to_dataframe(np.log(truth['lambdas'])),"Lhat":logL.squeeze()}).corr()
print("Correlation of log lambda with estimate (after normalization): %f" % C.values[0][-1])
assert C.values[0][-1]>0.95, "loglambda correlation with truth too low."

print("Mean of errors:")
print(e.mean(axis=0))

def test_mean():
    assert np.abs(e.stack().mean())/e.stack().std() < 1e-2    

test_mean()
#+end_src

#+results: test_estimate_with_missing
#+begin_example
Norm of error in approximation of CE: 129.991822
Correlation of log lambda with estimate (before normalization): nan
Norm of (bphi,beta): 0.013563
Correlation of log lambda with estimate (after normalization):
                  loglambda  loglambda0
t m                                  
0 1   loglambda    1.000000    0.815898
      loglambda0   0.815898    1.000000
1 1   loglambda    1.000000    0.822589
      loglambda0   0.822589    1.000000
            loglambda  loglambda0
loglambda    1.000000    0.818635
loglambda0   0.818635    1.000000
Mean of errors:
x0    0.031482
x1    0.023607
x2    0.005174
x3    0.042346
x4   -0.022142
x5   -0.008444
x6    0.046394
x7   -0.046577
x8   -0.166377
x9    0.050700
dtype: float64
#+end_example

* Utility Functions

#+name: df_utils
#+BEGIN_SRC python :noweb no-export :results output :tangle ../cfe/df_utils.py
#name: df_utils

import numpy as np
from scipy import sparse
import pandas as pd
from warnings import warn

def df_norm(a,b=None,ignore_nan=True,ord=None):
    """
    Provides a norm for numeric pd.DataFrames, which may have missing data.

    If a single pd.DataFrame is provided, then any missing values are replaced with zeros, 
    the norm of the resulting matrix is returned.

    If an optional second dataframe is provided, then missing values are similarly replaced, 
    and the norm of the difference is replaced.

    Other optional arguments:

     - ignore_nan :: If False, missing values are *not* replaced.
     - ord :: Order of the matrix norm; see documentation for numpy.linalg.norm.  
              Default is the Froebenius norm.
    """
    a=a.copy()
    if not b is None:
      b=b.copy()
    else:
      b=pd.DataFrame(np.zeros(a.shape),columns=a.columns,index=a.index)

    if ignore_nan:
        missing=(a.isnull()+0.).replace([1],[np.NaN]) +  (b.isnull()+0.).replace([1],[np.NaN]) 
        a=a+missing
        b=b+missing
    return np.linalg.norm(a.fillna(0).values - b.fillna(0).values)

def df_to_orgtbl(df,tdf=None,sedf=None,conf_ints=None,float_fmt='\\(%5.3f\\)',bonus_stats=None):
    """
    Returns a pd.DataFrame in format which forms an org-table in an emacs buffer.
    Note that headers for code block should include ":results table raw".

    Optional inputs include conf_ints, a pair (lowerdf,upperdf).  If supplied, 
    confidence intervals will be printed in brackets below the point estimate.

    If conf_ints is /not/ supplied but sedf is, then standard errors will be 
    in parentheses below the point estimate.

    If tdf is False and sedf is supplied then stars will decorate significant point estimates.
    If tdf is a df of t-statistics stars will decorate significant point estimates.

    if sedf is supplied, this creates some space for =bonus_stats= to be reported on each row.

    BUGS: Dataframes that have multiindex columns can't be nicely represented as orgmode tables, 
    but we do our best.
    """
    if len(df.shape)==1: # We have a series?
        df = pd.DataFrame(df) 

    # Test for duplicates in index
    if df.index.duplicated().sum()>0:
        warn('Dataframe index contains duplicates.')

    # Test for duplicates in columns
    if df.columns.duplicated().sum()>0:
        warn('Dataframe columns contain duplicates.')

    try: # Look for a multiindex
        levels = len(df.index.levels)
        names = ['' if v is None else v for v in df.index.names]
    except AttributeError: # Single index
        levels = 1
        names = [df.index.name if (df.index.name is not None) else '']

    def column_heading(df):
        try: # Look for multiindex columns
            collevels = len(df.columns.levels)
            colnames = ['' if v is None else v for v in df.columns.names]
        except AttributeError: # Single index
            collevels = 1
            colnames = [df.columns.name if (df.columns.name is not None) else '']

        if collevels == 1:
            s = '| ' + ' | '.join(names) + ' | ' + '|   '.join([str(s) for s in df.columns])+'  |\n|-\n'
        else:
            colhead = np.array(df.columns.tolist()).T
            lastcol = ['']*collevels
            for l,j in enumerate(colhead.T.copy()):
                for k in range(collevels):
                    if lastcol[k] == j[k]: colhead[k,l] = ''
                lastcol = j

            colhead = colhead.tolist()
            s = ''
            for k in range(collevels):
                if k < collevels - 1:
                    s += '| '*levels + ' | '
                else:
                    s += '| ' + ' | '.join(names) + ' | '
                s += ' | '.join(colhead[k]) + '  |\n'
            s += '|-\n'

        return s

    def se_linestart(stats,i):
        if stats is None: 
            return '|'*levels
        else:
            stats = stats.loc[i]
            assert levels >= len(stats), "Too many columns of bonus stats"
            line = ['']*(levels-len(stats)+1)
            line += stats.tolist()
            return ' | '.join(line) 

    s = column_heading(df)

    if (tdf is None) and (sedf is None) and (conf_ints is None):
        lastidx = ['']*levels
        for i in df.index:
            if levels == 1: # Normal index
                s += '| %s  ' % i
            else:
                for k in range(levels):
                    if lastidx[k] != i[k]:
                        s += '| %s ' % i[k]
                    else:
                        s += '| '
            lastidx =i 
    
            for j in df.columns: # Point estimates
                try:
                    entry='| '+float_fmt+' '
                    if np.isnan(df[j][i]):
                        s+='| --- '
                    else:
                        s+=entry % df[j][i]
                except TypeError:
                    s += '| %s ' % str(df[j][i])
            s+='|\n'
        return s
    elif not (tdf is None) and (sedf is None) and (conf_ints is None):
        lastidx = ['']*levels
        for i in df.index:
            if levels == 1: # Normal index
                s += '| %s  ' % i
            else:
                for k in range(levels):
                    if lastidx[k] != i[k]:
                        s += '| %s ' % i[k]
                    else:
                        s += '| '
            lastidx = i 

            for j in df.columns:
                try:
                    stars=(np.abs(tdf[j][i])>1.65) + 0.
                    stars+=(np.abs(tdf[j][i])>1.96) + 0.
                    stars+=(np.abs(tdf[j][i])>2.577) + 0.
                    stars = int(stars)
                    if stars>0:
                        stars='^{'+'*'*stars + '}'
                    else: stars=''
                except KeyError: stars=''
                entry='| '+float_fmt+stars+' '
                if np.isnan(df[j][i]):
                    s+='| --- '
                else:
                    s+=entry % df[j][i]
            s+='|\n'

        return s
    elif not (sedf is None) and (conf_ints is None): # Print standard errors on alternate rows
        if tdf is not False:
            try: # Passed in dataframe?
                tdf.shape
            except AttributeError:  
                tdf=df[sedf.columns]/sedf

        lastidx = ['']*levels
        for i in df.index:
            if levels == 1: # Normal index
                s += '| %s  ' % i
            else:
                for k in range(levels):
                    if lastidx[k] != i[k]:
                        s += '| %s ' % i[k]
                    else:
                        s += '| '
            lastidx = i 

            for j in df.columns: # Point estimates
                if tdf is not False:
                    try:
                        stars=(np.abs(tdf[j][i])>1.65) + 0.
                        stars+=(np.abs(tdf[j][i])>1.96) + 0.
                        stars+=(np.abs(tdf[j][i])>2.577) + 0.
                        stars = int(stars)
                        if stars>0:
                            stars='^{'+'*'*stars + '}'
                        else: stars=''
                    except KeyError: stars=''
                else: stars=''
                entry='| '+float_fmt+stars+'  '
                if np.isnan(df[j][i]):
                    s+='| --- '
                else:
                    s+=entry % df[j][i]
            s+='|\n' + se_linestart(bonus_stats,i)
            for j in df.columns: # Now standard errors
                s+='  '
                try:
                    if np.isnan(df[j][i]): # Pt estimate miss
                        se=''
                    elif np.isnan(sedf[j][i]):
                        se='(---)'
                    else:
                        se='(' + float_fmt % sedf[j][i] + ')' 
                except KeyError: se=''
                entry='| '+se+'  '
                s+=entry 
            s+='|\n'
        return s
    elif not (conf_ints is None): # Print confidence intervals on alternate rows
        if tdf is not False and sedf is not None:
            try: # Passed in dataframe?
                tdf.shape
            except AttributeError:  
                tdf=df[sedf.columns]/sedf
        lastidx = ['']*levels
        for i in df.index:
            if levels == 1: # Normal index
                s += '| %s  ' % i
            else:
                for k in range(levels):
                    if lastidx[k] != i[k]:
                        s += '| %s ' % i[k]
                    else:
                        s += '| ' 
            lastidx = i 

            for j in df.columns: # Point estimates
                if tdf is not False and tdf is not None:
                    try:
                        stars=(np.abs(tdf[j][i])>1.65) + 0.
                        stars+=(np.abs(tdf[j][i])>1.96) + 0.
                        stars+=(np.abs(tdf[j][i])>2.577) + 0.
                        stars = int(stars)
                        if stars>0:
                            stars='^{'+'*'*stars + '}'
                        else: stars=''
                    except KeyError: stars=''
                else: stars=''
                entry='| '+float_fmt+stars+' '
                if type(df[j][i]) is not str and np.isnan(df[j][i]):
                    s+='| --- '
                else:
                    s+=entry % df[j][i]
            s+='|\n' + se_linestart(bonus_stats,i)

            for j in df.columns: # Now confidence intervals
                s+='  '
                try:
                    ci='[' + float_fmt +','+ float_fmt + ']'
                    ci= ci % (conf_ints[0][j][i],conf_ints[1][j][i])
                except KeyError: ci=''
                entry='| '+ci+'  '
                s+=entry 
            s+='|\n'
        return s

def orgtbl_to_df(table, col_name_size=1, format_string=None, index=None, dtype=None):
  """
  Returns a pandas dataframe.
  Requires the use of the header `:colnames no` for preservation of original column names.

  - `table` is an org table which is just a list of lists in python.
  - `col_name_size` is the number of rows that make up the column names.
  - `format_string` is a format string to make the desired column names.
  - `index` is a column label or a list of column labels to be set as the index of the dataframe.
  - `dtype` is type of data to return in DataFrame.  Only one type allowed.
  """
  import pandas as pd

  if col_name_size==0:
    return pd.DataFrame(table)

  colnames = table[:col_name_size]

  if col_name_size==1:
    if format_string:
      new_colnames = [format_string % x for x in colnames[0]]
    else:
      new_colnames = colnames[0]
  else:
    new_colnames = []
    for colnum in range(len(colnames[0])):
      curr_tuple = tuple([x[colnum] for x in colnames])
      if format_string:
        new_colnames.append(format_string % curr_tuple)
      else:
        new_colnames.append(str(curr_tuple))

  df = pd.DataFrame(table[col_name_size:], columns=new_colnames)

  if index:
    df.set_index(index, inplace=True)

  return df

def drop_missing(X,infinities=False):
    """
    Return tuple of pd.DataFrames in X with any 
    missing observations dropped.  Assumes common index.

    If infinities is false values of plus or minus infinity are 
    treated as missing values.
    """

    foo=pd.concat(X,axis=1)
    if not infinities:
        foo.replace(np.inf,np.nan)
        foo.replace(-np.inf,np.nan)

    foo = foo.dropna(how='any')

    assert len(set(foo.columns))==len(foo.columns) # Column names must be unique!

    Y=[]
    for x in X:
        Y.append(foo.loc[:,pd.DataFrame(x).columns]) 

    return tuple(Y)

def use_indices(df,idxnames):
    return df.reset_index()[idxnames].set_index(df.index)
#+END_SRC

#+name: test_df_norm
#+BEGIN_SRC python :noweb no-export :results output :tangle ../cfe/stochastic_test/test_df_norm.py
#name: test_df_norm



import numpy as np
import pandas as pd
from cfe.df_utils import df_norm
from cfe.dgp import expenditures #, lambdas, characteristics, measurement_error  
from cfe.result import to_dataframe
import pytest

def artificial_data(T=2,N=120,M=1,k=2,n=4,sigma_e=0.001,sigma_phi=0.1):
    x,truth=expenditures(N,T,M,n,k,beta=np.linspace(1,3,n),sigma_phi=sigma_phi,sigma_eps=sigma_e)
    y=np.log(x+0.001)
    return y,truth

a,truth=artificial_data(T=2,N=5000,k=2,n=10,sigma_e=1e-10)
a = to_dataframe(a,['j','t','m']).T
# create another random matrix for subtracting 
b = pd.DataFrame(np.random.normal(size = a.shape), index = a.index, columns = a.columns)

# introduce NAs for a test case
a_missing = a.copy()
b_missing = b.copy()
for i in range(5000):
    row_a = np.random.randint(low=0, high = a.shape[0])
    col_a = np.random.randint(low=0, high = a.shape[1])
    a_missing.iloc[row_a, col_a] = np.NaN

    row_b = np.random.randint(low=0, high = b.shape[0])
    col_b = np.random.randint(low=0, high = b.shape[1])
    b_missing.iloc[row_b, col_b] = np.NaN

tol = 1e-4

@pytest.mark.parametrize("m", [
    a,
    a_missing,
])
def test_norm_onemat(m):
    mynorm = (m**2).sum().sum()**.5
    df_norm_norm = df_norm(m)
    assert np.abs(mynorm - df_norm_norm) < tol

@pytest.mark.parametrize("m, n", [
    (a, b),
    (a_missing, b_missing),
    (a, b_missing),
    (a_missing, b)
])
def test_norm_twomat(m, n):
    net = m - n
    mynorm = (net**2).sum().sum()**.5
    df_norm_norm = df_norm(m, n)
    assert np.abs(mynorm - df_norm_norm) < tol
#+END_SRC

#+name: test_df_to_orgtbl_tbl
#name: test_df_to_orgtbl_tbl

| A |  B | C |
|---+----+---|
| a |  1 | m |
| b | 2. | c |

#+name: test_df_to_orgtbl
#+BEGIN_SRC python :noweb no-export :results output raw table :var X=test_df_to_orgtbl_tbl :colnames no :tangle ../cfe/test/test_df_to_orgtbl.py
#name: test_df_to_orgtbl

<<df_utils>>

try:
    df = orgtbl_to_df(X).set_index('A')
except NameError: # Some tangling doesn't include var declarations?
    X=[["A", "B", "C"], ["a", 1, "m"], ["b", 2, "c"]]
    df = orgtbl_to_df(X).set_index('A')


s = df_to_orgtbl(df)
assert(s[-4]=='c')
print(s)
#+END_SRC

#+results: test_df_to_orgtbl
|   | B         | C |
|---+-----------+---|
| a | \(1.000\) | m |
| b | \(2.000\) | c |

** Utility functions for dealing with some awkward multiindex issues

#+name: broadcast_binary_op 
#+BEGIN_SRC python :noweb no-export :tangle  ../cfe/df_utils.py
#name: broadcast_binary_op

def merge_multi(df1, df2, on):
    """Merge on subset of multiindex.
   
    Idea due to http://stackoverflow.com/questions/23937433/efficiently-joining-two-dataframes-based-on-multiple-levels-of-a-multiindex
    """
    return df1.reset_index().join(df2,on=on).set_index(df1.index.names)

def broadcast_binary_op(x, op, y):
    """Perform x op y, allowing for broadcasting over a multiindex.

    Example usage: broadcast_binary_op(x,lambda x,y: x*y ,y)
    """
    x = pd.DataFrame(x.copy())
    y = pd.DataFrame(y.copy())
    xix= x.index.copy()

    if y.shape[1]==1: # If y a series, expand to match x.
        y=pd.DataFrame([y.iloc[:,0]]*x.shape[1],index=x.columns).T

    cols = list(x.columns)
    xindex = list(x.index.names)
    yindex = list(y.index.names)

    dif = list(set(xindex)-set(yindex))

    z = pd.DataFrame(index=xix)
    z = merge_multi(z,y,on=yindex)

    newdf = op(x[cols],z[cols])

    return newdf
#+END_SRC

Test the merge_multi() function, comparing it to pandas join().

#+name: test_merge_multi
#+BEGIN_SRC python :noweb no-export :tangle ../cfe/stochastic_test/test_merge_multi.py
#name: test_merge_multi


import numpy as np
import pandas as pd
from cfe.df_utils import merge_multi
from cfe.dgp import expenditures #, lambdas, characteristics, measurement_error  
from cfe.result import to_dataframe
import pytest

def artificial_data(T=2,N=120,M=1,k=2,n=4,sigma_e=0.001,sigma_phi=0.1):
    x,truth=expenditures(N,T,M,n,k,beta=np.linspace(1,3,n),sigma_phi=sigma_phi,sigma_eps=sigma_e)
    y=np.log(x+0.001)
    return y,truth

N = 5000
tol = 1e-4

a,truth=artificial_data(T=2,N=N,k=2,n=10,sigma_e=1e-10)
a = to_dataframe(a,['j','t','m']).T

# make a dataframe with a subset of the index of the previous one 
b = pd.DataFrame(np.random.normal(size=(N,1)), columns = ['b'])
b.index.names = ['j']

# make one that has some missing info
b_subset = b.iloc[1:500, :].copy()


@pytest.mark.parametrize("b", [
    b,
    b_subset,
])
def test_merge_multi(b):
    mymerge = a.join(b)
    merge_multi_test = merge_multi(a, b, on='j')

    assert np.sum(np.abs(mymerge - merge_multi_test)).sum() <  tol


#+END_SRC

#+name: test_broadcast_binary_op
#+BEGIN_SRC python :noweb no-export :tangle ../cfe/test/broadcast_binary_op.py
#name: test_broadcast_binary_op

import pandas as pd
from numpy import array, nan

<<broadcast_binary_op>>

foo=array([[        nan,         nan,         nan],
           [        nan,         nan,         nan],
           [        nan,         nan,         nan],
           [        nan,         nan,         nan],
           [        nan,         nan, -0.73396916],
           [-0.14518201,         nan,  0.88238915],
           [        nan,         nan, -0.49532144],
           [        nan,         nan,  0.55594608],
           [ 0.30538166,         nan,         nan],
           [        nan,         nan,  0.22884155],
           [        nan,         nan,  0.10763069],
           [ 0.36909748,         nan, -0.57661338],
           [ 0.        ,         nan, -0.38566246],
           [ 0.31845372,         nan,  0.92198873],
           [        nan,         nan,         nan],
           [        nan,         nan,         nan],
           [        nan,         nan,         nan],
           [ 1.2039728 ,         nan,         nan],
           [-0.62860866, -0.69314718,  6.27914662],
           [-0.28768207,  0.        ,  1.60943791]])

idx=[ (u'101005', u'2009Q1', u'BGD'),  (u'101005', u'2011Q1', u'BGD'),
      (u'101007', u'2009Q1', u'BGD'),  (u'101007', u'2011Q1', u'BGD'),
      (u'00L0101', u'2013Q3', u'GHA'), (u'00L0101', u'2014Q3', u'GHA'),
      (u'00L0202', u'2013Q3', u'GHA'), (u'00L0202', u'2014Q3', u'GHA'),
      (u'02L0101', u'2012Q1', u'GHA'), (u'02L0101', u'2012Q3', u'GHA'),
      (u'02L0101', u'2013Q1', u'GHA'), (u'02L0202', u'2012Q1', u'GHA'),
      (u'02L0202', u'2013Q1', u'GHA'), (u'02L0238', u'2012Q3', u'GHA'),
      (1002, u'2014Q3', u'SSD'),       (1006, u'2014Q3', u'SSD'),
      (1002, u'2015Q2', u'SSD'),       (1006, u'2015Q2', u'SSD'),
      (u'3015', u'2010Q4', u'UGA'),    (u'3016', u'2010Q4', u'UGA')]

foo=pd.DataFrame(foo,index=pd.MultiIndex.from_tuples(idx,names=['j','t','m']))
foo=foo.sort_index()

bar=array([[ 0.24921932,         nan,         nan],
       [ 0.21093294,         nan,         nan],
       [ 0.33506356,  0.33506356,  0.33506356],
       [ 0.28271356,  0.26914329,  0.26914329],
       [ 0.23344945,  0.10095022,  0.0796501 ],
       [ 0.02299849, -0.25550914, -0.10560527],
       [ 0.0486334 ,  0.34874107,  0.17723716],
       [ 0.28000935,  0.05786949,  0.28000935],
       [ 0.01387462,         nan,         nan],
       [ 0.30318531,         nan,  0.30318531]])

idx=[(u'2009Q1', u'BGD'), (u'2011Q1', u'BGD'), (u'2011Q3', u'UGA'),
       (u'2012Q1', u'GHA'), (u'2012Q3', u'GHA'), (u'2013Q1', u'GHA'),
       (u'2013Q3', u'GHA'), (u'2014Q3', u'GHA'), (u'2014Q3', u'SSD'),
       (u'2015Q2', u'SSD')]

bar = pd.DataFrame(bar,index=pd.MultiIndex.from_tuples(idx,names=['t','m']))

baz=broadcast_binary_op(foo, lambda x,y: x+y, bar)

assert baz.shape == foo.shape
print(baz)

#+END_SRC

#+results: test_broadcast_binary_op
#+begin_example
                           0   1         2
j       t      m                        
1002    2014Q3 SSD       NaN NaN       NaN
        2015Q2 SSD       NaN NaN       NaN
1006    2014Q3 SSD       NaN NaN       NaN
        2015Q2 SSD  1.507158 NaN       NaN
00L0101 2013Q3 GHA       NaN NaN -0.556732
        2014Q3 GHA  0.134827 NaN  1.162398
00L0202 2013Q3 GHA       NaN NaN -0.318084
        2014Q3 GHA       NaN NaN  0.835955
02L0101 2012Q1 GHA  0.588095 NaN       NaN
        2012Q3 GHA       NaN NaN  0.308492
        2013Q1 GHA       NaN NaN  0.002025
02L0202 2012Q1 GHA  0.651811 NaN -0.307470
        2013Q1 GHA  0.022998 NaN -0.491268
02L0238 2012Q3 GHA  0.551903 NaN  1.001639
101005  2009Q1 BGD       NaN NaN       NaN
        2011Q1 BGD       NaN NaN       NaN
101007  2009Q1 BGD       NaN NaN       NaN
        2011Q1 BGD       NaN NaN       NaN
3015    2010Q4 UGA       NaN NaN       NaN
3016    2010Q4 UGA       NaN NaN       NaN
#+end_example

#+name: test_broadcast_binary_op2
#+BEGIN_SRC python :noweb no-export :tangle ../cfe/test/broadcast_binary_op2.py
#name: test_broadcast_binary_op2

import pandas as pd
from numpy import array, nan

<<broadcast_binary_op>>

idx=pd.MultiIndex.from_tuples([(0,0,0),(0,0,1),(0,1,0),(0,1,1),
                               (1,0,0),(1,0,1),(1,1,0),(1,1,1)],names=('a','b','c'))

foo = pd.DataFrame({'x':range(8)},index=idx)

idx=pd.MultiIndex.from_tuples([(0,0),(0,1),(1,0),(1,1)],names=('b','c'))

bar = pd.DataFrame({'y':range(4)},index=idx)

baz = broadcast_binary_op(foo,lambda x,y:x+y,bar)

assert baz.iloc[3,0]==6
#+END_SRC

#+results: test_broadcast_binary_op2



